# -*- coding: utf-8 -*-
# @Time    : 2018/07/13 16:09:06
# @Author  : Izumi Sakai
# @File    : dict_.py
# @Software: PyCharm

Python = {
    '技术前景':{
        '网站建设':{
            '知名网站':{
                'Youtube':'全球最大视频网站',
                '豆瓣':'国内知名影评网站',
                '知乎':'国内最专业问答网站',
            },
            '具备条件':{
                'Pthon框架技术':{
                    'Django',
                    'Flask',
                    'tornado',
                },
                'Linux系统':{
                    '常用命令',
                    '权限管理',
                },
                '数据库':{
                    'mysql':'关系型数据库',
                    'redis':'非关系行数据库',
                    'Mongodb':'非关系型数据库',
                },
            },
        },
        '搜索引擎':{
            '知名网站':{
                'Baidu':'国内最大搜索引擎',
                'Google':'全球最大搜索引擎',
                '有道':'国内最专业翻译引擎',
            },
            '具备条件':{
                '爬虫':{
                    '爬虫原理',
                    '反爬手段',
                },
                'scrapy框架':{
                    '调度器',
                    '引擎',
                    '中间键',
                    '管道',
                    '下载器',
                    'spider',
                }
            }
        },
        '网络安全':{
            'sqlmap':{
                '全球最牛逼SQL注入工具',
                {'作用':'数据库渗透'},
                {'解释':'自动化检查数据库漏洞'},
            },
            'scapy工具':{
                '应用层以下的开发',
                '80%黑客工具都可以基于它开发',
            },
            'golismero工具':'个人计算机渗透(PC)，调查计算机系统型号，猜测账户密码',
        },
        '自动化运维':{},
        '人工智能':{},
        '大数据与云计算':{},
    },
    '就业前景':{},
}